Manipulación de datos en SQL
===

* *30 min* | Última modificación: Junio 22, 2019

In [1]:
## conexión a la base de datos
%load_ext sql
%sql mysql+pymysql://root:@localhost
%config SqlMagic.autopandas = True
import pandas
pandas.set_option('display.notebook_repr_html', False)

In [2]:
%%sql
DROP DATABASE IF EXISTS DMLdb;
CREATE DATABASE DMLdb;
USE DMLdb;

CREATE TABLE persons (
    id INT,
    firstname VARCHAR(10),
    surname VARCHAR(10),
    birthday DATE,
    color VARCHAR(9),
    quantity INT
);

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.

Empty DataFrame
Columns: []
Index: []

----

## SOURCE

Permite ejecutar scripts de SQL.

     SOURCE filename
     
(no funciona dentro de Jupyter)

---

## INSERT

    INSERT [INTO] tbl_name [(column_name,...)]
    {VALUES | VALUE}
    ({expression|DEFAULT},...)[,(...),...];

In [3]:
%%sql
--
-- Inserta el registro en la tabla.
-- Los valores están en el mismo orden de los campos.
--
INSERT INTO persons VALUES
   (1,"Vivian","Hamilton","1971-07-08","green",1);
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

   id firstname   surname    birthday  color  quantity
0   1    Vivian  Hamilton  1971-07-08  green         1

In [4]:
%%sql
--
-- Inserta varios registros a la vez.
-- Los valores deben estar en el mismo orden de los campos.
--
INSERT INTO persons VALUES
    (2,"Karen","Holcomb","1974-05-23","green",4),
    (3,"Cody","Garrett","1973-04-22","orange",1);
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
2 rows affected.
3 rows affected.

   id firstname   surname    birthday   color  quantity
0   1    Vivian  Hamilton  1971-07-08   green         1
1   2     Karen   Holcomb  1974-05-23   green         4
2   3      Cody   Garrett  1973-04-22  orange         1

In [5]:
%%sql
--
-- Inserta registros con información parcial.
-- Se indica en cuales campos se inserta la información.
--
INSERT INTO persons (color,firstname,surname) VALUES
    ("violet","Vivian", "Kinney"),
    ("blue","Hope","Kingston"),
    ("red","Kylan","Bigelow");
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
3 rows affected.
6 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN    Vivian    Kinney        None  violet       NaN
4  NaN      Hope  Kingston        None    blue       NaN
5  NaN     Kylan   Bigelow        None     red       NaN

In [6]:
%%sql
--
-- Inserta un registro con información en un solo campo.
-- Se indica en cual campo se inserta la información
--
INSERT persons (firstname) VALUE ("Camil");
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
7 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN    Vivian    Kinney        None  violet       NaN
4  NaN      Hope  Kingston        None    blue       NaN
5  NaN     Kylan   Bigelow        None     red       NaN
6  NaN     Camil      None        None    None       NaN

In [7]:
%%sql
--
-- Se inserta información en un registro.
-- No se indican los nombres de los campos.
-- Se usa NULL para los campos que no tienen información.
--
INSERT INTO 
    persons 
VALUES
    (NULL,"Kate","Bond","1974-05-23",NULL,NULL);
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
8 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN    Vivian    Kinney        None  violet       NaN
4  NaN      Hope  Kingston        None    blue       NaN
5  NaN     Kylan   Bigelow        None     red       NaN
6  NaN     Camil      None        None    None       NaN
7  NaN      Kate      Bond  1974-05-23    None       NaN

## UPDATE

     UPDATE tbl_name
     (SET col_name={expression|DEFAULT}, ...)
     [WHERE where_conditions];

In [8]:
%%sql
--
-- Se actualiza la información de los campos de registros existentes.
-- Se indica explictamente el valor de cada campo.
-- Si no se introduce la clausura WHERE se cambian todos los 
-- los registros de la tabla.
--
UPDATE persons SET
    id = 8, 
    color = "gray"
WHERE 
    firstname = "Kate";
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
8 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN    Vivian    Kinney        None  violet       NaN
4  NaN      Hope  Kingston        None    blue       NaN
5  NaN     Kylan   Bigelow        None     red       NaN
6  NaN     Camil      None        None    None       NaN
7  8.0      Kate      Bond  1974-05-23    gray       NaN

In [9]:
%%sql
##
## Se actualiza el campo con base en el indicador.
##
UPDATE 
    persons 
SET 
   color = "black" 
WHERE 
   id = 8;

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
8 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN    Vivian    Kinney        None  violet       NaN
4  NaN      Hope  Kingston        None    blue       NaN
5  NaN     Kylan   Bigelow        None     red       NaN
6  NaN     Camil      None        None    None       NaN
7  8.0      Kate      Bond  1974-05-23   black       NaN

## DELETE

    DELETE FROM tbl_name [WHERE where_conditions];

In [10]:
%%sql
--  
-- Se borran registros de la tabla.
-- Si no se usa WHERE se borran todos los registros de la tabla.
--
DELETE FROM 
  persons
WHERE 
  firstname="Vivian" AND color="violet";

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
7 rows affected.

    id firstname   surname    birthday   color  quantity
0  1.0    Vivian  Hamilton  1971-07-08   green       1.0
1  2.0     Karen   Holcomb  1974-05-23   green       4.0
2  3.0      Cody   Garrett  1973-04-22  orange       1.0
3  NaN      Hope  Kingston        None    blue       NaN
4  NaN     Kylan   Bigelow        None     red       NaN
5  NaN     Camil      None        None    None       NaN
6  8.0      Kate      Bond  1974-05-23   black       NaN

## LOAD DATA

    LOAD DATA [LOW_PRIORITY | CONCURRENT] [LOCAL] INFILE 'file_name'
        [REPLACE | IGNORE]
        INTO TABLE tbl_name
        [PARTITION (partition_name [, partition_name] ...)]
        [CHARACTER SET charset_name]
        [{FIELDS | COLUMNS}
            [TERMINATED BY 'string']
            [[OPTIONALLY] ENCLOSED BY 'char']
            [ESCAPED BY 'char']
        ]
        [LINES
           [STARTING BY 'string']
           [TERMINATED BY 'string']
        ]
        [IGNORE number {LINES | ROWS}]
        [(col_name_or_user_var
        [, col_name_or_user_var] ...)]
        [SET col_name={expr | DEFAULT},
            [, col_name={expr | DEFAULT}] ...]

In [11]:
%%writefile DMLpersons.csv
1,Vivian,Hamilton,1971-07-08,green,1
2,Karen,Holcomb,1974-05-07,green,4
3,Cody,Garrett,1973-04-22,orange,1
4,Roth,Fry,1975-01-29,black,1
5,Zoe,Conway,1969-07-03,blue,2
6,Gretchen,Kinney,1974-10-18,viole,1
7,Driscoll,Klein,1970-10-05,blue,5
8,Karyn,Diaz,1969-02-24,red,1
9,Merritt,Guy,1974-10-17,indigo,4
10,Kylan,Sexton,1975-02-28,black,4
11,Jordan,Estes,1969-12-07,indigo,4
12,Hope,Coffey,1973-12-24,green,5
13,Vivian,Crane,1970-08-27,gray,5
14,Clio,Noel,1972-12-12,red,5
15,Hope,Silva,1970-07-01,blue,5
16,Ayanna,Jarvis,1974-02-11,orange,5
17,Chanda,Boyer,1973-04-01,green,4
18,Chadwick,Knight,1973-04-29,yellow,1

Overwriting DMLpersons.csv

In [5]:
## %%sql
## --
## -- Permite cargar datos desde el disco duro.
## -- Es e## ## ## l##  complemento de SELECT ... INTO ...
## -- La B## ## ## D de## be estar configurada para permitir carga de datos.
## -- Se d## ## ## ebe ## indicar el orden de los campos en el archivo en 
## -- el c## ## ## omando.
## -- El a## ## rchivo no contiene cabecera.
##  --
## 
## -- NO FUNCIONA DENTRO DE JUPYTER
## 
## --LOAD DATA LOCAL INFILE
## --    '/vagrant/source/sesion-05/DMLpersons.csv'
## --INTO TABLE 
## --    persons
## --FIELDS TERMINATED BY ',' 
## --IGNORE 1 LINES 
## --    (id,firstname,surname,birthday,color,quantity);
## 
## --SELECT * FROM persons;

In [6]:
!rm DMLpersons.csv